#!/bin/bash
#+-------------------------------------腳本說明--------------------------------------------+
# MARKWEB_SERVER部署結果訊息傳送
# 使用方式: ./send_line_notify.sh
#
# (C) 2023 - markhsu - licensed under markweb License v1.
#
#+----------------------------------------------------------------------------------------+

#+----------------------------------------------------------------------------------------+
#                                     增加LINE NOTIFY通知
#+----------------------------------------------------------------------------------------+
apt update && apt install curl -y

# 從Jenkins參數取得訊息

MESSAGE="項目名稱:$1
部署版號:$2
部署日誌:$3
部署結果:$8
部署分支:$4
提交識別碼:$5
工作目錄:$6
"

# DEBUG 訊息
echo "項目名稱:$1"
echo "部署版號:$2"
echo "部署日誌:$3"
echo "部署結果:$8"
echo "部署分支:$4"
echo "提交識別碼:$5"
echo "工作目錄:$6"

# 呼叫Line notify API
curl -X POST -H "Authorization: Bearer $7" \
    -F "message=$MESSAGE" \
    https://notify-api.line.me/api/notify